---
kind: other
id: Methods.T:Autodesk.Revit.DB.DefinitionBindingMap
source: html/7d30dd56-e928-ee9a-7095-664ac9491fbb.htm
---
# DefinitionBindingMap Methods

Removes every binding from the map, rendering it empty.